In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.array([5,7,9,np.NaN,np.NaN,np.NaN,-5,0,25,999,1,0,np.NaN,0,np.NaN]).reshape(5,3))

In [4]:
df

       0    1     2
0    5.0  7.0   9.0
1    NaN  NaN   NaN
2   -5.0  0.0  25.0
3  999.0  1.0   0.0
4    NaN  0.0   NaN

In [5]:
df.dropna()

       0    1     2
0    5.0  7.0   9.0
2   -5.0  0.0  25.0
3  999.0  1.0   0.0

In [6]:
df.dropna(axis=0, thresh=1, inplace=True)

In [7]:
df

       0    1     2
0    5.0  7.0   9.0
2   -5.0  0.0  25.0
3  999.0  1.0   0.0
4    NaN  0.0   NaN

In [8]:
df.dropna(axis=0, thresh=3, inplace=True)
df

       0    1     2
0    5.0  7.0   9.0
2   -5.0  0.0  25.0
3  999.0  1.0   0.0

In [9]:
df.replace({999:np.NaN, 25:np.NaN}, inplace=True)

In [10]:
df

     0    1    2
0  5.0  7.0  9.0
2 -5.0  0.0  NaN
3  NaN  1.0  0.0

In [11]:
df.dropna(axis=0, thresh=3, inplace=True)
df

     0    1    2
0  5.0  7.0  9.0